Ran Plan for dir: `terraform-aws` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.web_app will be created
+ resource "aws_instance" "web_app" {
      + ami                                  = "ami-674cbc1e"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "m5.4xlarge"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + ebs_block_device {
          + delete_on_termination = true
          + device_name           = "my_data"
          + encrypted             = (known after apply)
          + iops                  = 1200
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 3000
          + volume_type           = "io1"
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # aws_lambda_function.hello_world will be created
+ resource "aws_lambda_function" "hello_world" {
      + arn                            = (known after apply)
      + function_name                  = "hello_world"
      + handler                        = "exports.test"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:lambda:us-east-1:account-id:resource-id"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

#####
Running Infracost atlantis_diff.sh in debug mode, remove atlantis_debug=true from Atlantis configs to disable debug outputs.

Running infracost breakdown using:
  $ infracost breakdown --no-color --path /home/atlantis/.atlantis/repos/infracost/atlantis-demo/6/default/terraform-aws/default.tfplan --format json
time="2021-05-14T14:47:30Z" level=info msg="Detected Terraform plan file at /home/atlantis/.atlantis/repos/infracost/atlantis-demo/6/default/terraform-aws/default.tfplan"
time="2021-05-14T14:47:30Z" level=info msg="starting: Running terraform show"
time="2021-05-14T14:47:30Z" level=info msg="Running command: /usr/local/bin/terraform show -no-color -json default.tfplan"
time="2021-05-14T14:47:31Z" level=info msg="starting: Calculating monthly cost estimate"

Update: A new version of Infracost is available: v0.8.1 → v0.8.6
  $ curl -s -L https://github.com/infracost/infracost/releases/latest/download/infracost-linux-amd64.tar.gz | tar xz -C /tmp && \
    sudo mv /tmp/infracost-linux-amd64 /usr/local/bin/infracost
Running infracost output using:
  $ infracost output --no-color --format diff --path infracost_breakdown.json

Update: A new version of Infracost is available: v0.8.1 → v0.8.6
  $ curl -s -L https://github.com/infracost/infracost/releases/latest/download/infracost-linux-amd64.tar.gz | tar xz -C /tmp && \
    sudo mv /tmp/infracost-linux-amd64 /usr/local/bin/infracost
Posting comment as post_condition is set to has_diff and there is a diff
##### Infracost estimate #####

Monthly cost will increase by $1019

Previous monthly cost: $0.00
New monthly cost: $1019

Infracost output:

    Project: /home/atlantis/.atlantis/repos/infracost/atlantis-demo/6/default/terraform-aws/default.tfplan
    
    + aws_instance.web_app
      +$1,019
    
        + Linux/UNIX usage (on-demand, m5.4xlarge)
          +$561
    
        + root_block_device
        
            + General Purpose SSD storage (gp2)
              +$5.00
    
        + ebs_block_device[0]
        
            + Provisioned IOPS SSD storage (io1)
              +$375
        
            + Provisioned IOPS
              +$78.00
    
    + aws_lambda_function.hello_world
      Cost depends on usage
    
        + Requests
          Cost depends on usage
            +$0.20 per 1M requests
    
        + Duration
          Cost depends on usage
            +$0.0000166667 per GB-seconds
    
    Monthly cost change for /home/atlantis/.atlantis/repos/infracost/atlantis-demo/6/default/terraform-aws/default.tfplan
    Amount:  +$1,019 ($0.00 -> $1,019)
    
    ----------------------------------
    Key: ~ changed, + added, - removed
    
    To estimate usage-based resources use --usage-file, see https://infracost.io/usage-file

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-aws`
* :put_litter_in_its_place: To **delete** this plan click [here](http://847f701e654b:4141/lock?id=infracost%252Fatlantis-demo%252Fterraform-aws%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-aws`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
